namespace Task_05_06
{
    internal class Program
    {
        /*Осуществить генерация двумерного [10*5] массива по следующему правилу:
         * 1 столбец содержит нули
         * 2 столбце содержит числа кратные 2
         * 3 столбец содержит числа кратные 3
         * 4 столбец содержит числа кратные 4
         * 5 столбец содержит числа кратные 5
         * Осуществить переворот массива (поменять строки и столбцы местами) вывести обновленный массив 
         */
        
                }
            }
        }
    }
}
